#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # snowflake_database.landing_db will be created
  + resource "snowflake_database" "landing_db" {
      + comment                     = "Some comment"
      + data_retention_time_in_days = (known after apply)
      + id                          = (known after apply)
      + name                        = "RAW"
    }

  # module.landing_schema1.snowflake_schema.db_schema will be created
  + resource "snowflake_schema" "db_schema" {
      + data_retention_days = 1
      + database            = "RAW"
      + id                  = (known after apply)
      + is_managed          = false
      + is_transient        = false
      + name                = "SCHEMA_1"
    }

  # module.landing_schema1.snowflake_table.db_schema_table["TABLE_1"] will be created
  + resource "snowflake_table" "db_schema_table" {
      + database = "RAW"
      + id       = (known after apply)
      + name     = "TABLE_1"
      + owner    = (known after apply)
      + schema   = "SCHEMA_1"

      + column {
          + name = "COL1"
          + type = "VARCHAR(100)"
        }
      + column {
          + name = "COL2"
          + type = "VARCHAR(100)"
        }
    }

  # module.landing_schema2.snowflake_schema.db_schema will be created
  + resource "snowflake_schema" "db_schema" {
      + data_retention_days = 1
      + database            = "RAW"
      + id                  = (known after apply)
      + is_managed          = false
      + is_transient        = false
      + name                = "SCHEMA_2"
    }

  # module.landing_schema2.snowflake_table.db_schema_table["CUSTOMER"] will be created
  + resource "snowflake_table" "db_schema_table" {
      + database = "RAW"
      + id       = (known after apply)
      + name     = "CUSTOMER"
      + owner    = (known after apply)
      + schema   = "SCHEMA_2"

      + column {
          + name = "CUSTOMER_KEY"
          + type = "NUMBER(38,0)"
        }
      + column {
          + name = "DOB"
          + type = "TIMESTAMP_NTZ(9)"
        }
      + column {
          + name = "NAME"
          + type = "VARCHAR(100)"
        }
    }

  # module.landing_schema2.snowflake_table.db_schema_table["TRANSACTION"] will be created
  + resource "snowflake_table" "db_schema_table" {
      + database = "RAW"
      + id       = (known after apply)
      + name     = "TRANSACTION"
      + owner    = (known after apply)
      + schema   = "SCHEMA_2"

      + column {
          + name = "CUSTOMER_KEY"
          + type = "NUMBER(38,0)"
        }
      + column {
          + name = "TRANSACTION_DATETIME"
          + type = "TIMESTAMP_NTZ(9)"
        }
      + column {
          + name = "TRANSACTION_KEY"
          + type = "NUMBER(38,0)"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>

*Pusher: @alexjreilly, Action: `pull_request`, Workflow: `tf-snowflake`*